#include "stdio.h"

int a[10],book[10],total = 0;

void dfs(int step)//step表示站在第几个盒子面前
{
	int i;
	if(step == 10)//如果站在第十个盒子面前，表示前九个盒子已经放好扑克牌
	{
		//判断□□□ X □□□ = □□□是否满足
		if(a[1] * 100 + a[2] * 10 + a[3] + a[4] * 100 + a[5] * 10 + a[6] == a[7] * 100 + a[8] * 10 + a[9])
		{
			//如果满足则可行解加1，并打印这组解
			printf("%d%d%d + %d%d%d = %d%d%d\n",a[1],a[2],a[3],a[4],a[5],a[6],a[7],a[8],a[9] );
			total++;
		}
		return;//返回之前的一步(最近调用的地方)
	}

	//此时站在第step个盒子面前，应该放那张牌呢？
	//按照1,2,3。。。n的顺序一一尝试
	for(i = 1;i <= 9;i++)
	{
		//判断扑克牌i是否还在手上
		if(book[i] == 0)//book[i]为0表示扑克牌还在手上
		{
			//开始尝试扑克牌i
			a[step] = i;//将扑克牌i放入到step盒中
			book[i] = 1;//将book[i]设置为1，表示扑克牌i已经不在手中

			//将step个盒子已经放好扑克牌，走到下一个盒子面前
			dfs(step + 1);//这里通过函数的递归调用来实现(自己调用自己)

			//这是非常重要的一步，一定要将刚才尝试的扑克牌收回，才能进行下一次尝试
			book[i] = 0;
		}
	}
	return;
}

int main()
{
	dfs(1);//首先站在第一个盒子面前

	printf("total = %d",total / 2 );//交换顺序的情况算一种所以除2
	getchar();getchar();
	return 0;
}
//168?