/**********************************************************************
字符串是回文的话，那么它必须是中间对称的
判断回文的关键步骤：
将字符串前半段字符入栈，然后依次出栈，看看能否与mid之后的字符一一匹配，
如果都匹配则说明这个字符串是回文字符串，否则这个字符串就不是回文字符串。
***********************************************************************/

/****************
示例输入：		*
	ahaha		*
示例输出：		*
	YES			*
****************/

#include <stdio.h>
#include <string.h>
int main()
{
	char a[101],s[101];
	int i,len,mid,next,top;
	gets(a); //读入一行字符串
	len = strlen(a); //求字符串的长度，头文件需引入string.h
	mid = len/2-1; //求字符串的中点，应为数组从下标0开始，故要减1
	top = 0;//栈的初始化
	//将mid前的字符依次入栈
	for(i=0;i<=mid;i++)
		s[++top]=a[i];//与top++;s[top] = a[i];功能一样
	//判断字符串的长度是奇数还是偶数，并找出需要进行字符匹配的起始下标
	if(len%2==0)
		next=mid+1;
	else
		next=mid+2;
	//开始匹配
	for(i=next;i<=len-1;i++)
	{
		if(a[i]!=s[top])
		break;
		top--;
	}
	//如果top的值为0，则说明栈内所有的字符都被一一匹配了
	if(top==0)
		printf("YES");
	else
		printf("NO");
	getchar();getchar();
	return 0;
}
